docs/api/cfd/cases/turbulent_flat_plate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Turbulent flat-plate boundary layer — k-omega SST verification (dm #1168)      |
|  Two-block: 0.2 m symmetry run-in + 1.0 m plate; H=0.3 m; y-graded to y+~1.    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 1;

vertices
(
    (-0.2  0     0      )   // 0
    ( 0    0     0      )   // 1
    ( 1.0  0     0      )   // 2
    ( 1.0  0.3   0      )   // 3
    ( 0    0.3   0      )   // 4
    (-0.2  0.3   0      )   // 5
    (-0.2  0     0.01   )   // 6
    ( 0    0     0.01   )   // 7
    ( 1.0  0     0.01   )   // 8
    ( 1.0  0.3   0.01   )   // 9
    ( 0    0.3   0.01   )   // 10
    (-0.2  0.3   0.01   )   // 11
);

blocks
(
    // run-in: 40 x 140 cells, strong wall clustering
    hex (0 1 4 5 6 7 10 11) (40 140 1)  simpleGrading (1 3000 1)
    // plate: 320 x 140 cells
    hex (1 2 3 4 7 8 9 10) (320 140 1)  simpleGrading (1 3000 1)
);

edges ();

boundary
(
    inlet    { type patch; faces ( (0 6 11 5) ); }
    outlet   { type patch; faces ( (2 3 9 8) ); }
    symmetry { type symmetryPlane; faces ( (0 1 7 6) ); }
    plate    { type wall; faces ( (1 2 8 7) ); }
    top      { type patch; faces ( (5 11 10 4) (4 10 9 3) ); }
    frontAndBack
    {
        type empty;
        faces ( (0 1 4 5) (1 2 3 4) (6 7 10 11) (7 8 9 10) );
    }
);

mergePatchPairs ();
