docs/api/cfd/cases/turbulent_flat_plate/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
transportModel  Newtonian;
nu              1e-06;
