docs/api/cfd/cases/turbulent_flat_plate/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);
boundaryField
{
    inlet    { type fixedValue; value uniform (1 0 0); }
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value uniform (1 0 0); }
    symmetry { type symmetryPlane; }
    plate    { type noSlip; }
    top      { type pressureInletOutletVelocity; value uniform (1 0 0); }
    frontAndBack { type empty; }
}
