docs/api/cfd/cases/turbulent_flat_plate/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
// I = 2% turbulence intensity: k = 1.5*(I*U)^2 = 6e-4
internalField   uniform 6e-4;
boundaryField
{
    inlet    { type fixedValue; value uniform 6e-4; }
    outlet   { type inletOutlet; inletValue uniform 6e-4; value uniform 6e-4; }
    symmetry { type symmetryPlane; }
    plate    { type kLowReWallFunction; value uniform 1e-11; }
    top      { type inletOutlet; inletValue uniform 6e-4; value uniform 6e-4; }
    frontAndBack { type empty; }
}
